<h3>Multiline Strings</h3>

In [1]:
# Use triple quotes

multistring=  '''This is
  a
multiline string.'''

print(multistring)

This is
  a
multiline string.

<h3>String Slicing</h3>

In [3]:
string = 'Python'

print(string[2])
print(string[-4])
# print(string[99]) will not work since the index is out of range
print(string[1:3])
print(string[-5:-2])
print(string[:4])
print(string[:-2])
print(string[4:])
print(string[-2:])
print(string[4:4])
print(string[:])
print(string[:100]) # Prints the entire string if the end index exceeds the size
print(string[0::2])

t
t
yt
yth
Pyth
Pyth
on
on

Python
Python
Pto

<h3>String Methods</h3>

In [3]:
print(string.upper())
print(string.lower())
print(string.title())
print(len(string))
print((string.lower()).islower())

PYTHON
python
Python
6
True

<h3>String Operations</h3>

<b>By default, joining using comma (,) will include spacings between strings but not concatenation (+)</b>

In [17]:
str1 = "Good"
str2 = "morning"
print(str1 + str2)
print(str1, str2)

Goodmorning
Good morning

<b>Concatenation of string different data types will not work:</b>

In [6]:
str = "String"
int = 3
print(str + int)

TypeError: can only concatenate str (not "int") to str

<b>This works:</b>

In [7]:
print(string, int)

Python 3

<b>String Slicing</b>

In [21]:
date = 'Thu Jan 29 2015 04:30:00 GMT-0800 (PST)'
print(date[11:15])

2015

<h3>Python Numbers</h3>

In [10]:
x = 34
y = 34.4
z = 3j # Only j is acceptable as the representation of complex part

# Exponential
a = 2e6
b = 3E4
c = 1.2e5

print(type(x))
print(type(y))
print(type(z))
print(type(a))
print(type(b))
print(type(c))

<class 'int'>
<class 'float'>
<class 'complex'>
<class 'float'>
<class 'float'>
<class 'float'>

<h3>Python Random</h3>

In [35]:
import random

print(random.randint(1, 101))

86

<h3>Python Operations (Division)</h3>

In [31]:
del int
x = 5
y = 3

print(x / y)
print(int(x / y))
print(x // y)
print(x % y)

1.6666666666666667
1
1
2

<h3>Python Comparison</h3>

<b>Identity Operator (for object comparisons):</b>

In [17]:
class Object:
    val = None

obj1 = Object()
obj2 = Object()

obj1.val = 'string'
obj2.val = 5

print(type(obj1.val))
print(type(obj2.val))

obj1.val = 5
obj2.val = 5

print(obj1 is obj2)
print(obj1 is not obj2)
print(obj1 is obj1)

<class 'str'>
<class 'int'>
False
True
True

<b>Membership Operator</b>

In [25]:
str = 'string'
print('ng' in str)
print(str in str)
print(str + str in str)
print(str + str not in str)

True
True
False
True

<h3>Conditional Structure (If Else)</h3>

In [43]:
import math as m

x = float(input("Enter a number: "))

if m.floor(x) == x:
    x = int(x)

if x > 0:
    print(f'{x} is a positive number.')
elif x < 0:
    print(f'{x} is a negative number.')
else:
    print(f'{x} is neither positive nor negative.')

7 is a positive number.

<h3>Repetition Structure (Loop)</h3>

In [7]:
for x in range(6):
    print(x, end = ' ')

print('')
for x in range(1, 6, 3):
    print(x, end = ' ')

0 1 2 3 4 5
1 4

<h3>Python Type Conversion</h3>

In [46]:
x = 125
print(f'x is originally {type(x)}.')
x_str = str(x)
print(f'x is now {type(x_str)}.')

x is originally <class 'int'>.
x is now <class 'str'>.

In [52]:
x = 125
print(x + 10)
x_str = str(x)
print(x_str + 10)

135

TypeError: can only concatenate str (not "int") to str

In [51]:
# Default data type of input is string, hence conversion is required
y = int(input('Enter a value: '))
print(y + 5)

12

<b>Important: Conversion between float and int</b>

In [65]:
# Essentially a floor function regardless if the decimal value is greater than 0.5 or not
num1 = 9.1
num2 = 9.9
print(int(num1))
print(int(num2))

9
9

<b>But not for round()</b>

In [68]:
val1 = 5.1
val2 = 5.5
val3 = 6.2
val4 = 6.6
print(round(val1))
print(round(val2))
print(round(val3))
print(round(val4))

5
6
6
7

<h3>Python Datetime</h3>

In [55]:
import datetime

time = datetime.datetime.now()
print(time)

# Convert to string before slicing

time = str(time)
print(f'Sliced date: {time[:10]}')

date = str(datetime.date.today())
print('\n' + date)

# Custom datetime
custom = datetime.datetime(2024, 5, 5)
print(custom)
print(type(custom))
custom = str(custom)
print(type(custom))

2024-07-23 15:24:55.109328
Sliced date: 2024-07-23

2024-07-23
2024-05-05 00:00:00
<class 'datetime.datetime'>
<class 'str'>

<b>Use of strftime()</b>

In [62]:
x = datetime.datetime(2020, 1, 1, 12, 30, 59, 0)

# Convert the datetime object to string of specific format
datetimeStr = x.strftime("%Y %B, %A %w, %H hours %M minutes")
print(datetimeStr)

2020 January, Wednesday 3, 12 hours 30 minutes

<h3>Input, Processing, Output</h3>

In [70]:
name = 'Gordon Chai'
print('My name is', name)

My name is Gordon Chai

<h3>Repetition Structures</h3>

In [71]:
i = 1
while i < 5:
    print(i)
    i += 1

1
2
3
4

In [72]:
count = 0
while (count < 3):
    count = count + 1
    print("Hello USM")

Hello USM
Hello USM
Hello USM

In [60]:
for x in range(2, 14, 3):
    print(x, end = ' ')

2 5 8 11

In [76]:
for x in range(5, 1, -1):
    print(x, end = ' ')

5 4 3 2

In [62]:
for x in range(5):
    print(x, end = ' ')

0 1 2 3 4

In [57]:
count = 0
for x in 'string':
    count += 1

print(count)
print(len('string'))

6
6

In [68]:
i = 1
while i < 6:
    if i == 3:
        break
    print(i, end = ' ')
    i += 1
print ("\nI want to take a break")

1 2
I want to take a break

In [71]:
i = 0
while i < 6:
    i += 1
    if i == 3:
        continue
    print(i, end = ' ')
print ("\nI want to take a break")

1 2 4 5 6
I want to take a break

<h3>Swapping Program</h3>

<b>Without Using Function</b>

In [59]:
x = 5
y = 6

print(x, y)

x, y = y, x

print(x, y)

5 6
6 5

<b>Using Function:</b>

In [58]:
def swap(x, y):
    return y, x

x = 3
y = 4

print(x, y)

x, y = swap(x, y)
print(x, y)

3 4
4 3

<h3>Python Function</h3>

In [34]:
def printName(fname, lname):
    print(fname, lname)

printName('Gordon', 'Chai')

Gordon Chai

In [72]:
# Creating a Function
def sum1(x, y):
    return x + y

# Calling a Function in main program
num1, num2 = 5, 15
answer = sum1(num1, num2)
print('The addition of num1 and num2 is', str(answer) + '.')

The addition of num1 and num2 is 20.

<b>Order of parameters and arguments are important (Positional Argument)</b>

In [85]:
def nameAge(name, age):
    print("Hi, I am", name, end = ', ')
    print("my age is ", str(age) +'.')

# wrong output because arguments are not given in order
nameAge("Lee", 27)
nameAge(48, "Nur")

Hi, I am Lee, my age is  27.
Hi, I am 48, my age is  Nur.

<b>Default Argument</b>

In [40]:
# Python program to demonstrate default arguments
def myFun(x = 50, y = 50):
    print("x:", x , end = ' ')
    print("y:", y)

myFun(20, 10)
myFun(10)
myFun()

x: 20 y: 10
x: 10 y: 50
x: 50 y: 50

<b>Function Return Statement: can return more than one value</b>

In [74]:
# Creating a Function
def add(x, y):
    sum = x + y
    avg = (x + y) / 2
    return sum, avg

# Calling a Function in main program
num1, num2 = 5, 15
answer, average = add(num1, num2)
print("The addition of num1 and num2 is", answer)
print("The average of num1 and num2 is", average)

The addition of num1 and num2 is 20
The average of num1 and num2 is 10.0

<h3><b>Revision Questions</b></h3>

In [90]:
print(9 // 2)

4

In [3]:
i = 0
while i < 3:
    print (i)
    i += 1 # i++ (increment does not work in Python)
    print (i + 1)

0
2
1
3
2
4

In [6]:
print(3 * 1 ** 3)

3

In [94]:
a = True
b = False
c = False
if not a or b:
    print (1)
elif not a or not b and c:
    print (2)
elif not a or b or not b and a:
    print (3)
else:
    print (4)

3

In [64]:
my_string = 'Hello'
for i in range(my_string):
    print(i)

TypeError: 'str' object cannot be interpreted as an integer

In [22]:
list = ['Hello', 'World', 'It\'s', 'Me']
for i in list:
    for j in i:
        print(j, end = '')
    print(' ', end = '')
print('')

# Is the same as
for i in list:
    print(i, end = ' ')

Hello World It's Me
Hello World It's Me

In [32]:
i = 1
while i < 6:
    if i == 3:
        i += 1
        continue
    print(i)
    i += 1
print ("I want to take a break")

1
2
4
5
I want to take a break

In [12]:
a = "20.6"
b = 3
print (a + b)

TypeError: can only concatenate str (not "int") to str

In [4]:
for i in range (0, 10, 2):
    if i == 8:
        break
    print(i)

0
2
4
6

<h3>List and Tuple</h3>

<b>List</b>

In [108]:
my_list_1 = [1, 2, 3, 4]
print(my_list_1)
print(type(my_list_1))

[1, 2, 3, 4]
<class 'list'>

In [113]:
my_list_2 = [1, 2.4, 'a string', ['a string in another list', 5]]
print(my_list_2)
print(my_list_2[3][0])

[1, 2.4, 'a string', ['a string in another list', 5]]
a string in another list

In [76]:
my_list_3 = [1 * 2, 2 ** 4, int(9 / 2.5)]
print(my_list_3)

[2, 16, 3]

In [51]:
my_str = 'A string'
my_str = list(my_str)
print(my_str)

['A', ' ', 's', 't', 'r', 'i', 'n', 'g']

In [106]:
emp_list = [89, 'Karan', 45,'Lecturer', 5500.75]
print(emp_list)
print(type(emp_list))

[89, 'Karan', 45, 'Lecturer', 5500.75]
<class 'list'>

<b>List: Concatenation, Replication, In and Not In</b>

In [123]:
list1 = [1, 2, 3]
list2 = [4, 5, 6]
print(list1 + list2)
print(list1 * 3)
print(2 in list1)

[1, 2, 3, 4, 5, 6]
[1, 2, 3, 1, 2, 3, 1, 2, 3]
True

In [131]:
my_list = [1, 2.4, 'a string', ['a string in another list', 5]]
print(2.4 in my_list)
print('a string in another list' in my_list)
print('a string in another list' not in my_list)
print('a string in another list' in my_list[3])

True
False
True
True

<b>List: Slicing and Unpacking</b>

In [54]:
my_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(my_list[:11]) 
# print(my_list[11]) --> index out of range (IndexError)
print(my_list[0:5])
print(my_list[3:1000])
print(my_list[::2])
print(my_list[::-1])
print(my_list[2:-1:2])
print(my_list[-2::-2])
print(my_list[2:2:-2])

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(my_list)
my_list[3] = 'four'
print(my_list)

# Unpacking List
my_list = [1, 2, 3]
a, b, c = my_list
print(a, b, c)
print(a)
print(b)
print(c)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[0, 1, 2, 3, 4]
[3, 4, 5, 6, 7, 8, 9, 10]
[0, 2, 4, 6, 8, 10]
[10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]
[2, 4, 6, 8]
[9, 7, 5, 3, 1]
[]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 'four', 5, 6, 7, 8, 9, 10]
1 2 3
1
2
3

<b>List: Methods</b>

In [153]:
# To add an item to the end of the list, use the append() method:
thislist = ["apple", "banana", "cherry"]
thislist.append("orange")
print(thislist)

['apple', 'banana', 'cherry', 'orange']

In [154]:
# To insert a list item at a specified index, use the insert() method.
# The insert() method inserts an item at the specified index:
thislist = ["apple", "banana", "cherry"]
thislist.insert(1, "orange")
print(thislist)

['apple', 'orange', 'banana', 'cherry']

In [78]:
# The remove() method removes the specified item.
thislist = ["apple", "banana", "cherry"]
thislist.remove("banana")
print(thislist)

['apple', 'cherry']

In [5]:
# If there are more than one item with the specified value, the remove() method removes the first occurence:
thislist = ["apple", "banana", "cherry", "banana", "kiwi"]
thislist.remove("banana")
print(thislist)

['apple', 'cherry', 'banana', 'kiwi']

In [59]:
# To remove the all occurences:
thislist = ["apple", "banana", "cherry", "banana", "kiwi"]

while 'banana' in thislist:
    thislist.remove('banana')

print(thislist)

['apple', 'cherry', 'kiwi']

In [159]:
# The pop() method removes the specified index.
thislist = ["apple", "banana", "cherry"]
thislist.pop(1)
print(thislist)

['apple', 'cherry']

In [160]:
# If you do not specify the index, the pop() method removes the last item.
thislist = ["apple", "banana", "cherry"]
thislist.pop()
print(thislist)

['apple', 'banana']

<b>List: extend()</b>

In [80]:
# To append elements from another list to the current list, use the extend() method.
thislist = ["apple", "banana", "cherry"]
tropical = ["mango", "pineapple", "papaya"]
thislist.extend(tropical)
print(thislist)
thislist *= 2
print(thislist)

['apple', 'banana', 'cherry', 'mango', 'pineapple', 'papaya']
['apple', 'banana', 'cherry', 'mango', 'pineapple', 'papaya', 'apple', 'banana', 'cherry', 'mango', 'pineapple', 'papaya']

In [156]:
# The extend() method does not have to append lists, you can add any iterable object (tuples, sets, dictionaries etc.).
thislist = ["apple", "banana", "cherry"]
thistuple = ("kiwi", "orange")
thislist.extend(thistuple)
print(thislist)

['apple', 'banana', 'cherry', 'kiwi', 'orange']

In [82]:
# The extend() method does not have to append lists, you can add any iterable object (tuples, sets, dictionaries etc.).
thislist = ["apple", "banana", "cherry"]
thistuple = ("kiwi", "orange")
thistuple.extend(thistuple)
print(thislist)
print(thistuple)

AttributeError: 'tuple' object has no attribute 'extend'

In [83]:
list1 = [1, 'a', 5.4]
list1.extend([3, 0.8])
print(list1)

[1, 'a', 5.4, 3, 0.8]

<b>List: Sorting</b>

In [161]:
# List objects have a sort() method that will sort the list alphanumerically, ascending, by default:
# Sort the list alphabetically:
thislist = ["orange", "mango", "kiwi", "pineapple", "banana"]
thislist.sort()
print(thislist)

['banana', 'kiwi', 'mango', 'orange', 'pineapple']

In [163]:
# To sort descending, use the keyword argument reverse = True:
thislist = ["orange", "mango", "kiwi", "pineapple", "banana"]
thislist.sort(reverse = True)
print(thislist)

['pineapple', 'orange', 'mango', 'kiwi', 'banana']

In [162]:
# Sort the list numerically:
thislist = [100, 50, 65, 82, 23]
thislist.sort()
print(thislist)

[23, 50, 65, 82, 100]

In [171]:
list2 = ['a','R','u','H']
list2.sort()
list2

['H', 'R', 'a', 'u']

<b>List: Copy</b>

In [85]:
# Make a copy of a list with the copy() method:
thislist = ["apple", "banana", "cherry"]
mylist = thislist.copy()
print(mylist)

['apple', 'banana', 'cherry']

In [86]:
# Another way to make a copy is to use the built-in method list() --> similar to .copy().
thislist = ["apple", "banana", "cherry"]
mylist = list(thislist)
print(mylist)

['apple', 'banana', 'cherry']

<b>List: Count</b>

In [89]:
points = [1, 4, 2, 9, 7, 8, 9, 3, 1]
points.count(9)

2

<b>List: Index</b>

In [90]:
points = [1, 4, 2, 9, 7, 8, 9, 3, 1]
points.index(9) # Returns index of first occurence

3

<b>Tuple</b>

In [107]:
emp_tuple=(89, 'Karan', 45, 'Lecturer', 5500.75)
print(emp_tuple)
print(type(emp_tuple))

(89, 'Karan', 45, 'Lecturer', 5500.75)
<class 'tuple'>

In [152]:
my_tuple = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# print(my_tuple[11]) index out of range (IndexError)
print(my_tuple[0:5])
print(my_tuple[3:1000])
print(my_tuple[::2])
print(my_tuple[::-1])
print(my_tuple[2:-1:2])
print(my_tuple[-2::-2])
print(my_tuple[2:2:-2])

my_tuple = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
print(my_tuple)
# my_tuple[3] = 'four' does not work since modifications are not allowed for tuples
# print(my_tuple)

# Unpacking Tuple
my_tuple = (1, 2, 3)
a, b, c = my_tuple
print(a, b, c)

(0, 1, 2, 3, 4)
(3, 4, 5, 6, 7, 8, 9, 10)
(0, 2, 4, 6, 8, 10)
(10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0)
(2, 4, 6, 8)
(9, 7, 5, 3, 1)
()
(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
1 2 3

In [9]:
mytuple = (1, 3, 4)
tuple2 = mytuple.copy()

AttributeError: 'tuple' object has no attribute 'copy'

In [82]:
mytuple = (1, 3, 4)
# tuple2 = mytuple.copy() --> Methods do not work on tuples
tuple2 = mytuple # Copy by reference works
print(tuple2)
tuple2 += ('test',)
print(tuple2)
tuple2 += mytuple
print(tuple2)

(1, 3, 4)
(1, 3, 4, 'test')
(1, 3, 4, 'test', 1, 3, 4)

<b>Tuple: Count</b>

In [67]:
tup = (1, 2, 3, 1, 1.0, 4)
print(tup.count(1))

3

In [87]:
list1 = [1,'a',5.4]
list1.extend([-3, 0.8])
list1

[1, 'a', 5.4, -3, 0.8]

In [89]:
list1=[9,8,7,6,5,4,3,2,1]
list1.pop(4)

5

In [91]:
list1 = [2, 3]
list2 = [4, 5]
(list1 * 2) + list2

[2, 3, 2, 3, 4, 5]

In [93]:
tup = (1, 2, 3, 1, 1.0, 4)
print(tup.count(1))

3

<b>Important Note: The only methods of tuples are count() and index()</b>

<h3>Quiz</h3>

In [94]:
list1 = [1, 'a', 5.4]
list1.extend([-3, 0.8])
list1

[1, 'a', 5.4, -3, 0.8]

In [93]:
list1 = [9, 8, 7, 6, 5, 4, 3, 2, 1]
list1.pop(4)

5

In [96]:
list3 = [1, 'a', 5.6, 9]
list3.sort()

TypeError: '<' not supported between instances of 'str' and 'int'

In [98]:
list1 = [2,3]
list2 = [4,5]

# [2, 3, 2, 3, 4, 5]

(list1 * 2) + list2

[2, 3, 2, 3, 4, 5]

In [100]:
var = (4)
print(type(4))
var = (4,)
print(type(var))

<class 'int'>
<class 'tuple'>

In [101]:
tup = (1, 2, 3, 1, 1.0, 4)
print(tup.count(1))

3

<h3>Keyword Arguments</h3>

In [104]:
def participation (name2, name1, name3):
    print("The WINNER is " + name2)

participation (name3 = "Emil", name1 = "Lim", name2 = "Shun")

The WINNER is Shun

<h3>Arbitrary Arguments (*args)</h3>

In [106]:
def participation (*name):
    print("The WINNER is " + name[2])

participation ("Emil", "Lim", "Nur")
participation ("Jo", "Joan", "Lee", "Nur")

The WINNER is Nur
The WINNER is Lee

<h3>Arbitrary Keyword Arguments (*kwargs)</h3>

In [107]:
def kid_name(**kid):
    print("The last name is " + kid["lname"])
    
kid_name(fname = "Eben", lname = "Christy")

The last name is Christy

<h3>User Defined Modules</h3>

In [132]:
%%writefile greet.py

def morning(name):
    print(f'Good morning, {name}!')

def afternoon(name):
    print(f'Good afternoon, {name}!')

def evening(name):
    print(f'Good evening, {name}!')

def greet(**kwargs):
    print(f'Good morning', kwargs["name1"])
    print(f'Good afternoon', kwargs["name2"])
    print(f'Good evening', kwargs["name3"])

Overwriting greet.py

In [134]:
import greet

greet.morning('Gordon')
greet.afternoon('Shun')
greet.evening('Yuri')
# dir(greet)

Good morning, Gordon!
Good afternoon, Shun!
Good evening, Yuri!

In [141]:
def greet1(*args):
    print(f'Good morning,', args[0])
    print(f'Good afternoon,', args[1])
    print(f'Good evening,', args[2])

def greet2(**kwargs):
    print(f'Good morning,', kwargs["name1"])
    print(f'Good afternoon,', kwargs["name2"])
    print(f'Good evening,', kwargs["name3"])  

greet1("Gordon", "Shun", "Yuri")
print('')
greet2(name1 = "Gordon", name2 = "Shun", name3 = "Yuri")

Good morning, Gordon
Good afternoon, Shun
Good evening, Yuri

Good morning, Gordon
Good afternoon, Shun
Good evening, Yuri

<h3>Working with Data in Python</h3>

In [1]:
import pandas as pd

In [44]:
df = pd.read_csv('Sales Report.csv')

In [188]:
# Select two columns
df[['Name', 'Address']]

        Name           Address
0       Eben  Penang, Malaysia
1    Christy      KL, Malaysia
2   Miraclyn   Johor, Malaysia
3  Elizabrth         Singapore
4   Mikelyn   Penang, Malaysia
5      Grace      KL, Malaysia
6       Eben  Penang, Malaysia
7      David     Ramnad, India
8     Kiruba    Madurai, India
9        Lim             China

In [202]:
# Select two row using .loc[]
df[['Name', 'Address']].loc[[2,5]]

       Name          Address
2  Miraclyn  Johor, Malaysia
5     Grace     KL, Malaysia

In [205]:
# Select rows based on index using [s:e:i]
# This is a special case where e is included
df.loc[1:9:2]

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
1,Christy,"KL, Malaysia",123450009,4,Pencil,3,15,45
3,Elizabrth,Singapore,84230001,10,Eraser,1,20,20
5,Grace,"KL, Malaysia",126340005,13,Color Pencils,2,8,16
7,David,"Ramnad, India",9997823456,18,Stabler,10,2,20
9,Lim,China,14467450987,20,Sticky Notes,6,4,24

In [16]:
df.iloc[-1] # Does not work for .loc since index are usually nonnegative

Name                         Lim
Address                    China
Telephone number     14467450987
Item number                   20
Item name           Sticky Notes
Item price                     6
Number of items                4
Total price                   24
Name: 9, dtype: object

In [26]:
df[['Item name', 'Item price']].iloc[::-1]

       Item name  Item price
9   Sticky Notes           6
8       Notebook          15
7        Stabler          10
6    Highlighter           8
5  Color Pencils           2
4          Ruler           2
3         Eraser           1
2    Pencil Case          10
1         Pencil           3
0            Pen           5

In [20]:
df.loc[-1:]

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
1,Christy,"KL, Malaysia",123450009,4,Pencil,3,15,45
2,Miraclyn,"Johor, Malaysia",126798001,6,Pencil Case,10,5,50
3,Elizabrth,Singapore,84230001,10,Eraser,1,20,20
4,Mikelyn,"Penang, Malaysia",129349009,12,Ruler,2,5,10
5,Grace,"KL, Malaysia",126340005,13,Color Pencils,2,8,16
6,Eben,"Penang, Malaysia",125780006,15,Highlighter,8,2,16
7,David,"Ramnad, India",9997823456,18,Stabler,10,2,20
8,Kiruba,"Madurai, India",9994563452,19,Notebook,15,5,75
9,Lim,China,14467450987,20,Sticky Notes,6,4,24

In [28]:
# Select a single row using .iloc[] (similar to list access, 0 indicates first element and so on, regardless of the index)
df.iloc[0:]

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
1,Christy,"KL, Malaysia",123450009,4,Pencil,3,15,45
2,Miraclyn,"Johor, Malaysia",126798001,6,Pencil Case,10,5,50
3,Elizabrth,Singapore,84230001,10,Eraser,1,20,20
4,Mikelyn,"Penang, Malaysia",129349009,12,Ruler,2,5,10
5,Grace,"KL, Malaysia",126340005,13,Color Pencils,2,8,16
6,Eben,"Penang, Malaysia",125780006,15,Highlighter,8,2,16
7,David,"Ramnad, India",9997823456,18,Stabler,10,2,20
8,Kiruba,"Madurai, India",9994563452,19,Notebook,15,5,75
9,Lim,China,14467450987,20,Sticky Notes,6,4,24

In [46]:
df_new = df.copy()
for x in df_new.index:
    if df_new.loc[x, "Item number"] > 10:
        df_new.loc[x, "Item number"] = 10

df_new

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
1,Christy,"KL, Malaysia",123450009,4,Pencil,3,15,45
2,Miraclyn,"Johor, Malaysia",126798001,6,Pencil Case,10,5,50
3,Elizabrth,Singapore,84230001,10,Eraser,1,20,20
4,Mikelyn,"Penang, Malaysia",129349009,10,Ruler,2,5,10
5,Grace,"KL, Malaysia",126340005,10,Color Pencils,2,8,16
6,Eben,"Penang, Malaysia",125780006,10,Highlighter,8,2,16
7,David,"Ramnad, India",9997823456,10,Stabler,10,2,20
8,Kiruba,"Madurai, India",9994563452,10,Notebook,15,5,75
9,Lim,China,14467450987,10,Sticky Notes,6,4,24

In [29]:
df.iat[-1, 2]

14467450987

In [30]:
df.iat[6, 1]

'Penang, Malaysia'

In [49]:
df_add = df.groupby('Address')
df_add.get_group('Penang, Malaysia')

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
4,Mikelyn,"Penang, Malaysia",129349009,12,Ruler,2,5,10
6,Eben,"Penang, Malaysia",125780006,15,Highlighter,8,2,16

In [216]:
address = df[df['Address'] == 'Penang, Malaysia']
address

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
4,Mikelyn,"Penang, Malaysia",129349009,12,Ruler,2,5,10
6,Eben,"Penang, Malaysia",125780006,15,Highlighter,8,2,16

<b>Is similar to:</b>

In [217]:
address = df.groupby('Address')
address.get_group('Penang, Malaysia')

,Name,Address,Telephone number,Item number,Item name,Item price,Number of items,Total price
0,Eben,"Penang, Malaysia",125780006,1,Pen,5,10,50
4,Mikelyn,"Penang, Malaysia",129349009,12,Ruler,2,5,10
6,Eben,"Penang, Malaysia",125780006,15,Highlighter,8,2,16

<b>Student Data Set</b>

In [214]:
df = pd.read_csv('stud.csv')

<h2>Past Year</h2>

In [52]:
def order(x):
    print("Method called for value:", x)
    return True if x > 0 else False
a = order
b = order
c = order

if a(-1) or b(5) or c(10):
    print("At least one of the number is positive")

Method called for value: -1
Method called for value: 5
At least one of the number is positive

In [58]:
a = [1,2,3,4,5,6,7,8,9]
print(a[::2])
b = (1,2,3,4,5,6,7,8,9)
print(b[::2])

[1, 3, 5, 7, 9]
(1, 3, 5, 7, 9)

In [60]:
a = [1,2,3,4,5,6,7,8,9]
a[::2] = 10,20,30,40,50
print(a)

[10, 2, 20, 4, 30, 6, 40, 8, 50]

In [61]:
a = [1,2,3,4,5]
print(a[3:0:-1])

[4, 3, 2]

In [63]:
init_tuple_a = ('1', '2')
init_tuple_b = ('3', '4')
print (init_tuple_a + init_tuple_b)

('1', '2', '3', '4')

In [65]:
init_tuple = ('Python') * 3
print(init_tuple)
print(type(init_tuple))

PythonPythonPython
<class 'str'>

In [69]:
int = 5
del int
x = 5.5
print(int(x))

5

In [70]:
print('list to string:',''.join(['g', 'o', 'l', 'd']))

list to string: gold

In [71]:
element = 'fluorine'
print(element[::2])

furn

In [72]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1,2,3,4,5,6, 7];
print("list1[0]", list1[0])

list1[0] physics

In [74]:
T1 = (1, 2, 3, 4, 5, 6, 7, 8)
print(T1[0])
print(T1[-1])
print(T1[2 + 3])
print(T1[4 - 1])
print(T1[7 % 2])
print(T1[0:3])

1
8
6
4
2
(1, 2, 3)

In [3]:
import numpy as np

u = np.array([1, 2])
v = np.array([3, 4])
print(u + v)
print(u.dot(v))

[4 6]
11

In [8]:
A = np.matrix([[1, 2], [3, 4]])
print(A)
print(f'\n{A.T}')
print(f'\n{A.dot(A.T)}')

[[1 2]
 [3 4]]

[[1 3]
 [2 4]]

[[ 5 11]
 [11 25]]

In [9]:
a = 123
a[1]

TypeError: 'int' object is not subscriptable

In [10]:
atom_name = 'carbon'
print('atom_name[1:3] is:', atom_name[1:3])

atom_name[1:3] is: ar

In [11]:
species_name = "Acacia buxifolia"

print(species_name[2:8])
print(species_name[11:]) # (without a value after the colon)
print(species_name[:4]) # (without a value before the colon)
print(species_name[:]) # (just a colon)
print(species_name[11:-3])
print(species_name[-5:-3])
print(species_name[0:20])

acia b
folia
Acac
Acacia buxifolia
fo
fo
Acacia buxifolia

In [13]:
element = 'lithium'
print(element[0:20])
print(element[-1:3])
print(element[-1:3:-1])

lithium

mui

In [18]:
print(10 / 3)
print((10 / 3) % 2)
print((10 / 3) % 2 + 4)
print(round((10 / 3) % 2 + 4))

3.3333333333333335
1.3333333333333335
5.333333333333334
5

In [20]:
A = np.array([[20, 10], [17, 22]])
B = np.array([350, 500])
A_inv = np.linalg.inv(A)
result = A_inv.dot(B)
print(result)

X = np.linalg.solve(A,B)
print(X)

[10. 15.]
[10. 15.]

In [21]:
num = int(input("Enter a number: "))

if num % 2 == 0:
    print(f'{num} is even.\n')
else:
    print(f'{num} is odd.\n')

3 is odd.

In [23]:
for i in range (0, 10, 2):
    if i == 8:
        break
    print(i)

0
2
4
6

In [25]:
emp_tuple = (89, 'Karan', 45, 'Lecturer', 5500.75)
print(emp_tuple)
emp_temp = list(emp_tuple)
emp_temp[4] = 5665
emp_tuple = tuple(emp_temp)
print(emp_tuple)

(89, 'Karan', 45, 'Lecturer', 5500.75)
(89, 'Karan', 45, 'Lecturer', 5665)